{
  "_description": "Autopilot process strategy — the autopilot reads this at startup and evolves it based on what it learns. This file lives in an allowed path so the autopilot can modify it.",
  "version": 4,
  "updatedAt": "2026-02-18",
  "updatedBy": "autopilot",

  "shipModes": {
    "_description": "How to ship completed tasks. The autopilot chooses the mode per-task based on risk and efficiency.",
    "branchPr": {
      "description": "Full ceremony: branch, test, PR, merge. Safest, most expensive (~12 turns overhead).",
      "useWhen": "FEATURE tasks, MEDIUM-risk changes, multi-file logic changes, any change you're not 100% confident about"
    },
    "directToMain": {
      "description": "Commit directly to main after tests pass. Cheapest (~3 turns overhead).",
      "useWhen": "LOW-risk MAINTENANCE tasks under 100 lines: test additions, config tweaks, dead code removal, documentation updates, adding guards or validation",
      "safeguards": "Must pass npm test before AND after commit. If post-commit test fails, immediately revert with git revert HEAD."
    },
    "batch": {
      "description": "Group 2-4 compatible small tasks into one branch/PR. Medium cost (~15 turns for 3 tasks vs ~36 for 3 separate PRs).",
      "useWhen": "Multiple MAINTENANCE tasks in the same pillar or touching the same files. Tasks must be independently correct (each commit passes tests).",
      "maxTasksPerBatch": 4
    }
  },

  "turnBudgets": {
    "_description": "Expected turn costs per activity. Updated by the autopilot based on actual measurements.",
    "preflight": 10,
    "perTask": {
      "maintenanceDirect": 4,
      "maintenanceBranchPr": 10,
      "feature": 15,
      "explore": 8
    },
    "scouting": 10,
    "metaLearning": 5,
    "reserve": 10
  },

  "quotaAdaptation": {
    "_description": "How the autopilot adapts behavior based on quota tier. Read docs/data/.quota-status.json at startup for the current tier and evaluation. Runtime parameters (model, maxTurns, allowedTools) are resolved from runtimeConfigFile merged with the quota tier — see scripts/resolve-autopilot-config.js. The autopilot can evolve these guidelines based on observed outcomes.",
    "statusFile": "docs/data/.quota-status.json",
    "runtimeConfigFile": "scripts/autopilot-config.json",
    "tierGuidance": [
      {
        "tier": 0,
        "name": "green",
        "taskTypes": "all",
        "maxTasksPerRun": null,
        "scoutingBudget": "full",
        "notes": "Full capability. Execute all pending tasks, invest in scouting and meta-learning."
      },
      {
        "tier": 1,
        "name": "moderate",
        "taskTypes": "maintenance+feature",
        "maxTasksPerRun": 4,
        "scoutingBudget": "reduced",
        "notes": "Prefer maintenance tasks. Reduce scouting to maintenance-only. Skip explore tasks. Stop earlier to conserve quota."
      },
      {
        "tier": 2,
        "name": "high",
        "taskTypes": "maintenance-only",
        "maxTasksPerRun": 2,
        "scoutingBudget": "skip",
        "notes": "Only critical maintenance and repairs. Skip scouting and meta-learning entirely. Minimize turns per task."
      },
      {
        "tier": 3,
        "name": "critical",
        "taskTypes": "none",
        "maxTasksPerRun": 0,
        "scoutingBudget": "skip",
        "notes": "Gate blocks the autopilot at this tier. Should never be reached."
      }
    ]
  },

  "processNotes": {
    "_description": "Accumulated process knowledge. The autopilot adds notes here about what works and what doesn't.",
    "entries": [
      {
        "date": "2026-02-16",
        "note": "First run with strategy file. Direct-to-main used for 2 small tasks (4 turns each), branch-pr for 2 features (10-15 turns). Feature tasks were faster than estimated (15 vs 25 budget). Preflight was 10 turns (included branch cleanup). Scouting used 10 turns via Task agents. Total: ~70 turns for 4 tasks + scouting + meta. Updated turn budgets to match actuals."
      },
      {
        "date": "2026-02-16",
        "note": "Run 3: 5 tasks in ~35 turns (4 completed + 1 already done). Chaining data→UI tasks (tennis rankings → inline widget) in same run is highly efficient — eliminates context-loading overhead. Direct-to-main saves ~6 turns per task vs branch-pr and was safe for all 2 uses. Pre-verifying task completion status avoids wasted work. Scouting via Task agent was efficient (~5 turns)."
      },
      {
        "date": "2026-02-17",
        "note": "Run 4: 4 tasks + 2 explores in ~30 turns. Mixed ship modes: 2 direct-to-main (trivial changes), 2 branch-pr (tennis fix + For You block). Explore tasks delegated to subagents efficiently (~5 turns for 2 investigations). Key learning: API structure assumptions caused 108 recurring warnings — always verify API response format before assuming empty means no data. Personalization pillar advanced from 50% to 58% with For You block + contextual empty-sport notes."
      },
      {
        "date": "2026-02-18",
        "note": "Run 5: 6 tasks + 1 repair + 1 explore in ~45 turns. Pre-flight repair needed (date-dependent tests broke overnight). 5 direct-to-main (4-5 turns each), 1 branch-pr (refactor, 6 turns). Quality pillar dominated: pipelineHealth unstuck, must-watch scope fixed, empty snapshot noise eliminated. Key learning: hint fatigue signals metric bugs, not LLM issues. Pattern report heuristic E most productive (5/6 tasks from pattern analysis). Explore tasks via subagent efficient (~5 turns). Total estimated: ~45 turns for 8 activities."
      }
    ]
  }
}
