{
  "brief": [
    "Johaug and Klaebo headline Norway's Olympic gold rush as Milano-Cortina 2026 reaches medal day.",
    "Boe brothers hunt biathlon glory while Arsenal's title lead tested at Brentford tomorrow.",
    "Liverpool chase leaders tonight at Sunderland — three points essential to stay in race."
  ],
  "sections": [
    {
      "id": "olympics-2026",
      "title": "Winter Olympics 2026",
      "emoji": "🏔️",
      "style": "highlight",
      "items": [
        {
          "text": "📍 Milano-Cortina, Italy • Day 6 of 17",
          "type": "stat"
        },
        {
          "text": "Today: Johaug targets 10km classic gold, Granerud and Lindvik chase ski jumping medals",
          "type": "event"
        },
        {
          "text": "Tomorrow: Boe brothers in biathlon individual, Kristoffersen and Braathen in giant slalom",
          "type": "event"
        },
        {
          "text": "Weekend: Klaebo's sprint free Friday, then the ultimate 50km mass start Sunday",
          "type": "event"
        }
      ],
      "expandLabel": "Full Norwegian schedule →",
      "expandItems": [
        {
          "text": "Fri 12:00 • Men's Sprint Free — Klaebo favorite for gold",
          "type": "event"
        },
        {
          "text": "Fri 15:00 • Nordic Combined — Riiber hunting first Olympic individual gold",
          "type": "event"
        },
        {
          "text": "Sat 10:00 • Women's Biathlon 15km — Roeiseland chasing gold",
          "type": "event"
        },
        {
          "text": "Sat 11:00 • Men's Downhill — Kilde's comeback story continues",
          "type": "event"
        },
        {
          "text": "Sun 08:00 • Men's 50km Mass Start — Klaebo in cross-country's crown jewel",
          "type": "event"
        },
        {
          "text": "Sun 16:00 • Large Hill Ski Jumping — Granerud's second medal shot",
          "type": "event"
        },
        {
          "text": "Mon 14:00 • Men's Biathlon Relay — Boe brothers anchor Norway's team",
          "type": "event"
        },
        {
          "text": "Tue 10:00 • Men's Slalom — Kristoffersen vs Braathen in Norwegian duel",
          "type": "event"
        }
      ]
    }
  ],
  "radar": [
    "Hovland tees off Sunday at Pebble Beach with new swing changes — AT&T Pro-Am perfect testing ground before Florida Swing begins.",
    "Ruud's clay season preparation begins in two weeks with South American swing — defending titles in Buenos Aires and Rio ahead of Monte Carlo Masters.",
    "Carlsen returns to classical chess in March for Candidates tournament watching duties — potential World Championship challenge brewing if Nepomniachtchi qualifies."
  ]
}