{
  "generatedAt": "2026-02-15T10:14:09.954Z",
  "patternsDetected": 9,
  "patterns": [
    {
      "type": "recurring_health_warning",
      "severity": "high",
      "issueCode": "sport_zero_events",
      "count": 66,
      "firstSeen": "2026-02-13T13:38:33.221Z",
      "lastSeen": "2026-02-15T10:14:09.950Z",
      "suggestion": "Health warning \"sport_zero_events\" has fired 66 times since 2026-02-13. Investigate and fix the root cause rather than letting it keep firing."
    },
    {
      "type": "quality_decline",
      "severity": "high",
      "metric": "editorialScore",
      "earlyAvg": 84,
      "lateAvg": 67,
      "drop": 18,
      "suggestion": "Editorial quality score dropped from 84 to 67 (18 point decline). Investigate recent prompt or data changes."
    },
    {
      "type": "quality_decline",
      "severity": "high",
      "metric": "mustWatchCoverage",
      "earlyAvg": 0.69,
      "lateAvg": 0.11,
      "drop": 0.59,
      "suggestion": "Must-watch coverage dropped from 69% to 11%. Featured content is missing high-importance events."
    },
    {
      "type": "stagnant_loop",
      "severity": "high",
      "loopName": "pipelineHealth",
      "score": 0.75,
      "stagnantRuns": 20,
      "suggestion": "Feedback loop \"pipelineHealth\" has been stuck at 0.75 for 20 consecutive runs. It needs intervention to progress toward 1.0."
    },
    {
      "type": "hint_fatigue",
      "severity": "high",
      "hintKey": "unknown",
      "fireCount": 20,
      "hintText": "RESULTS NOTE: Few recap headlines available — focus on scorelines and goal scorers rather than recap narratives.",
      "suggestion": "Hint \"RESULTS NOTE: Few recap headlines available — focus on scorelines and goal score...\" has fired 20 times without improving unknown. The hint-based approach isn't working — investigate the underlying code or data issue."
    },
    {
      "type": "hint_fatigue",
      "severity": "high",
      "hintKey": "unknown",
      "fireCount": 12,
      "hintText": "SANITY: Results data had quality issues: All 29 football results have null recapHeadline — RSS matching may be broken. B",
      "suggestion": "Hint \"SANITY: Results data had quality issues: All 29 football results have null recap...\" has fired 12 times without improving unknown. The hint-based approach isn't working — investigate the underlying code or data issue."
    },
    {
      "type": "hint_fatigue",
      "severity": "medium",
      "hintKey": "unknown",
      "fireCount": 8,
      "hintText": "SANITY: Previous brief had content issues: Featured block references \"\udfc5 Sun — Klaebo anchors men's relay\" which may not ",
      "suggestion": "Hint \"SANITY: Previous brief had content issues: Featured block references \"\udfc5 Sun — Kl...\" has fired 8 times without improving unknown. The hint-based approach isn't working — investigate the underlying code or data issue."
    },
    {
      "type": "hint_fatigue",
      "severity": "medium",
      "hintKey": "unknown",
      "fireCount": 6,
      "hintText": "SANITY: Results data had quality issues: All 25 football results have null recapHeadline — RSS matching may be broken. B",
      "suggestion": "Hint \"SANITY: Results data had quality issues: All 25 football results have null recap...\" has fired 6 times without improving unknown. The hint-based approach isn't working — investigate the underlying code or data issue."
    },
    {
      "type": "hint_fatigue",
      "severity": "medium",
      "hintKey": "mustWatchCoverage",
      "fireCount": 5,
      "hintText": "CORRECTION: Recent outputs missed must-watch events. You MUST include ALL events with importance ≥4. This is the highest",
      "suggestion": "Hint \"CORRECTION: Recent outputs missed must-watch events. You MUST include ALL events...\" has fired 5 times without improving mustWatchCoverage. The hint-based approach isn't working — investigate the underlying code or data issue."
    }
  ],
  "issueCodeHistory": {
    "failed_batches_increase": {
      "count": 4,
      "firstSeen": "2026-02-13T11:50:22.968Z",
      "lastSeen": "2026-02-14T22:11:30.098Z"
    },
    "sport_zero_events": {
      "count": 66,
      "firstSeen": "2026-02-13T13:38:33.221Z",
      "lastSeen": "2026-02-15T10:14:09.950Z"
    },
    "stale_output": {
      "count": 1,
      "firstSeen": "2026-02-14T13:07:46.228Z",
      "lastSeen": "2026-02-14T13:07:46.228Z"
    }
  },
  "summary": "9 patterns detected (6 high, 3 medium). Top priority: recurring_health_warning — Health warning \"sport_zero_events\" has fired 66 times since 2026-02-13."
}