{
  "generatedAt": "2026-02-14T20:12:16.741Z",
  "patternsDetected": 6,
  "patterns": [
    {
      "type": "recurring_health_warning",
      "severity": "high",
      "issueCode": "sport_zero_events",
      "count": 52,
      "firstSeen": "2026-02-13T13:38:33.221Z",
      "lastSeen": "2026-02-14T20:12:16.738Z",
      "suggestion": "Health warning \"sport_zero_events\" has fired 52 times since 2026-02-13. Investigate and fix the root cause rather than letting it keep firing."
    },
    {
      "type": "stagnant_loop",
      "severity": "high",
      "loopName": "pipelineHealth",
      "score": 0.75,
      "stagnantRuns": 20,
      "suggestion": "Feedback loop \"pipelineHealth\" has been stuck at 0.75 for 20 consecutive runs. It needs intervention to progress toward 1.0."
    },
    {
      "type": "hint_fatigue",
      "severity": "high",
      "hintKey": "unknown",
      "fireCount": 20,
      "hintText": "RESULTS NOTE: Few recap headlines available — focus on scorelines and goal scorers rather than recap narratives.",
      "suggestion": "Hint \"RESULTS NOTE: Few recap headlines available — focus on scorelines and goal score...\" has fired 20 times without improving unknown. The hint-based approach isn't working — investigate the underlying code or data issue."
    },
    {
      "type": "hint_fatigue",
      "severity": "high",
      "hintKey": "unknown",
      "fireCount": 17,
      "hintText": "SANITY: Results data had quality issues: All 29 football results have null recapHeadline — RSS matching may be broken. B",
      "suggestion": "Hint \"SANITY: Results data had quality issues: All 29 football results have null recap...\" has fired 17 times without improving unknown. The hint-based approach isn't working — investigate the underlying code or data issue."
    },
    {
      "type": "hint_fatigue",
      "severity": "high",
      "hintKey": "unknown",
      "fireCount": 12,
      "hintText": "SANITY: Previous brief had content issues: Featured block references \"\udfc5 Sun — Klaebo anchors men's relay\" which may not ",
      "suggestion": "Hint \"SANITY: Previous brief had content issues: Featured block references \"\udfc5 Sun — Kl...\" has fired 12 times without improving unknown. The hint-based approach isn't working — investigate the underlying code or data issue."
    },
    {
      "type": "hint_fatigue",
      "severity": "medium",
      "hintKey": "mustWatchCoverage",
      "fireCount": 6,
      "hintText": "CORRECTION: Recent outputs missed must-watch events. You MUST include ALL events with importance ≥4. This is the highest",
      "suggestion": "Hint \"CORRECTION: Recent outputs missed must-watch events. You MUST include ALL events...\" has fired 6 times without improving mustWatchCoverage. The hint-based approach isn't working — investigate the underlying code or data issue."
    }
  ],
  "issueCodeHistory": {
    "failed_batches_increase": {
      "count": 3,
      "firstSeen": "2026-02-13T11:50:22.968Z",
      "lastSeen": "2026-02-13T13:46:59.623Z"
    },
    "sport_zero_events": {
      "count": 52,
      "firstSeen": "2026-02-13T13:38:33.221Z",
      "lastSeen": "2026-02-14T20:12:16.738Z"
    },
    "stale_output": {
      "count": 1,
      "firstSeen": "2026-02-14T13:07:46.228Z",
      "lastSeen": "2026-02-14T13:07:46.228Z"
    }
  },
  "summary": "6 patterns detected (5 high, 1 medium). Top priority: recurring_health_warning — Health warning \"sport_zero_events\" has fired 52 times since 2026-02-13."
}